{
  "backend/main.mo": "Motoko actor that stores a Google Sheets CSV export URL and exposes public methods to fetch the CSV via HTTP outcall, get/set the URL, and validate its presence.",
  "feature_evidence.json": "Feature evidence report documenting that the 6th column (index 5) is hidden in SheetViewer.tsx from both table headers and data rows, with high confidence and linked to test REQ-12.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their purpose and key implementation details.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors for backgrounds, cards, charts, and sidebar components.",
  "frontend/index.html": "Minimal HTML shell for the React app with a root div and a module script tag loading main.tsx, titled 'Google Sheets Viewer'.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with two routes: '/' rendering SheetViewer and '/admin' rendering AdminPanel.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient lifecycle, login/logout state, and exposes identity and status via React context.",
  "frontend/src/hooks/useQueries.ts": "TanStack Query hooks for all backend interactions: checking URL validity, getting/setting the Google Sheets URL, fetching CSV data, and manually refreshing the sheet with cache invalidation.",
  "frontend/src/index.css": "Global stylesheet importing Inter/DM Sans fonts, defining a green/white OKLCH color palette for light and dark modes, and preventing horizontal overflow on mobile via max-width and overflow-x rules.",
  "frontend/src/lib/csvParser.ts": "Utility that parses a CSV string into a structured object with headers and rows, correctly handling quoted fields containing commas and embedded newlines.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page at /admin route that allows the site owner to view/update the Google Sheets URL and manually trigger a data refresh, displaying success/error feedback for each action.",
  "frontend/src/pages/SheetViewer.tsx": "Public read-only sheet viewer page that fetches Google Sheets CSV data, parses it, hides the 6th column, and renders it in a scrollable table with alternating row colors and hover highlighting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Inter, DM Sans), OKLCH-based design tokens for colors, custom box shadows, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata (version 15) describing the app's purpose, architecture, existing features, and known issues such as hidden column display bugs and mobile row highlight problems."
}